## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.grants_source_data_bucket.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
        tags                        = {
            "Attributes" = "357150818708-us-west-2"
            "Name"       = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
            "Namespace"  = "grantsingest-staging"
        }
        # (11 unchanged attributes hidden)

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = 1
+           enabled                                = true
+           id                                     = "temporary-storage-cleanup"
+           prefix                                 = "tmp/"
+           tags                                   = {}

+           expiration {
+               days                         = 7
+               expired_object_delete_marker = false
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_event_source_mapping.this["sqs"] has changed
  ~ resource "aws_lambda_event_source_mapping" "this" {
+       function_response_types            = []
        id                                 = "dfb153f3-fe8a-4de6-93e4-b850b9a1722a"
+       queues                             = []
+       topics                             = []
        # (15 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-05-25T22:16:10.000+0000" -> "2023-05-25T22:16:17.436+0000"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-05-25T22:16:00.250+0000" -> "2023-05-25T22:16:11.862+0000"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-05-25T22:32:07.000+0000" -> "2023-05-25T22:32:14.505+0000"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-05-25T22:16:09.000+0000" -> "2023-05-25T22:16:17.411+0000"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-05-25T22:16:16.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:7/invocations" -> (known after apply)
      ~ s3_key                         = "builds/0af21c6f9bb04b631794e6c4222eecd3ecf3f32542b6104cd196453b382852b7.zip" -> "builds/2c0281ea7a7609aab801ec853e8394310167a061f32d48ecce1269cee9090594.zip"
      ~ s3_object_version              = "gMDC3Va9PoqqqOmYKfLv4sjXUh63lpsF" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0393d998cfdef165d159376d79b10b67019b4ee7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:494796dc83a7401391a8bc0266cc1a95c67f0422,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "0393d998cfdef165d159376d79b10b67019b4ee7" -> "494796dc83a7401391a8bc0266cc1a95c67f0422"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "7" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d453e4fb76095a218e17372d17120830-2" -> (known after apply)
      ~ id                     = "builds/0af21c6f9bb04b631794e6c4222eecd3ecf3f32542b6104cd196453b382852b7.zip" -> (known after apply)
      ~ key                    = "builds/0af21c6f9bb04b631794e6c4222eecd3ecf3f32542b6104cd196453b382852b7.zip" -> "builds/2c0281ea7a7609aab801ec853e8394310167a061f32d48ecce1269cee9090594.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/0af21c6f9bb04b631794e6c4222eecd3ecf3f32542b6104cd196453b382852b7.zip" -> "builds/2c0281ea7a7609aab801ec853e8394310167a061f32d48ecce1269cee9090594.zip"
-       tags                   = {} -> null
      ~ version_id             = "gMDC3Va9PoqqqOmYKfLv4sjXUh63lpsF" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/2c0281ea7a7609aab801ec853e8394310167a061f32d48ecce1269cee9090594.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/2c0281ea7a7609aab801ec853e8394310167a061f32d48ecce1269cee9090594.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3131653261575460615" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0af21c6f9bb04b631794e6c4222eecd3ecf3f32542b6104cd196453b382852b7.zip" -> "builds/2c0281ea7a7609aab801ec853e8394310167a061f32d48ecce1269cee9090594.zip"
          ~ "timestamp" = "1685052950977675000" -> "1686263200398139000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "276481344257069520" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/0af21c6f9bb04b631794e6c4222eecd3ecf3f32542b6104cd196453b382852b7.zip" -> "builds/2c0281ea7a7609aab801ec853e8394310167a061f32d48ecce1269cee9090594.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-05-25T22:15:13.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:32" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:32/invocations" -> (known after apply)
      ~ s3_key                         = "builds/6392bde04390bb95685464e7c1e1b730c653c74d595f8f5e23136bfcc5a6058f.zip" -> "builds/3ed47deb49a061e26368625befabc5e3be7093805d0b6ad0294123fa8b76b327.zip"
      ~ s3_object_version              = "GODRzP.hKYI7qwJ0Lt3byMD8YxRZaZ.." -> (known after apply)
        tags                           = {}
      ~ version                        = "32" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:0393d998cfdef165d159376d79b10b67019b4ee7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:494796dc83a7401391a8bc0266cc1a95c67f0422,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "0393d998cfdef165d159376d79b10b67019b4ee7" -> "494796dc83a7401391a8bc0266cc1a95c67f0422"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "32" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "56be8e2ce77846643ad9d437f4ec42f4-2" -> (known after apply)
      ~ id                     = "builds/6392bde04390bb95685464e7c1e1b730c653c74d595f8f5e23136bfcc5a6058f.zip" -> (known after apply)
      ~ key                    = "builds/6392bde04390bb95685464e7c1e1b730c653c74d595f8f5e23136bfcc5a6058f.zip" -> "builds/3ed47deb49a061e26368625befabc5e3be7093805d0b6ad0294123fa8b76b327.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/6392bde04390bb95685464e7c1e1b730c653c74d595f8f5e23136bfcc5a6058f.zip" -> "builds/3ed47deb49a061e26368625befabc5e3be7093805d0b6ad0294123fa8b76b327.zip"
-       tags                   = {} -> null
      ~ version_id             = "GODRzP.hKYI7qwJ0Lt3byMD8YxRZaZ.." -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/3ed47deb49a061e26368625befabc5e3be7093805d0b6ad0294123fa8b76b327.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/3ed47deb49a061e26368625befabc5e3be7093805d0b6ad0294123fa8b76b327.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4949036650260483832" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6392bde04390bb95685464e7c1e1b730c653c74d595f8f5e23136bfcc5a6058f.zip" -> "builds/3ed47deb49a061e26368625befabc5e3be7093805d0b6ad0294123fa8b76b327.zip"
          ~ "timestamp" = "1685052877355986200" -> "1686263181558746000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "707693320485594273" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/6392bde04390bb95685464e7c1e1b730c653c74d595f8f5e23136bfcc5a6058f.zip" -> "builds/3ed47deb49a061e26368625befabc5e3be7093805d0b6ad0294123fa8b76b327.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-05-25T22:16:17.436+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:12/invocations" -> (known after apply)
      ~ s3_key                         = "builds/f986fdae4a9973c028029db0dcfef2eadd2f1ecd7b8c4d3de2586f8d41625adc.zip" -> "builds/a1d2442ec7974090e11d208222118de2ed187db6acde96c5907dd1dfcac96f73.zip"
      ~ s3_object_version              = "khZQTe96D46h.MaTW4aqyWF0WrL1eHBP" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0393d998cfdef165d159376d79b10b67019b4ee7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:494796dc83a7401391a8bc0266cc1a95c67f0422,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "0393d998cfdef165d159376d79b10b67019b4ee7" -> "494796dc83a7401391a8bc0266cc1a95c67f0422"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "12" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6c923fc554dbe7bf6ab6c5b74c864c63-2" -> (known after apply)
      ~ id                     = "builds/f986fdae4a9973c028029db0dcfef2eadd2f1ecd7b8c4d3de2586f8d41625adc.zip" -> (known after apply)
      ~ key                    = "builds/f986fdae4a9973c028029db0dcfef2eadd2f1ecd7b8c4d3de2586f8d41625adc.zip" -> "builds/a1d2442ec7974090e11d208222118de2ed187db6acde96c5907dd1dfcac96f73.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/f986fdae4a9973c028029db0dcfef2eadd2f1ecd7b8c4d3de2586f8d41625adc.zip" -> "builds/a1d2442ec7974090e11d208222118de2ed187db6acde96c5907dd1dfcac96f73.zip"
-       tags                   = {} -> null
      ~ version_id             = "khZQTe96D46h.MaTW4aqyWF0WrL1eHBP" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/a1d2442ec7974090e11d208222118de2ed187db6acde96c5907dd1dfcac96f73.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a1d2442ec7974090e11d208222118de2ed187db6acde96c5907dd1dfcac96f73.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6065919304006427041" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f986fdae4a9973c028029db0dcfef2eadd2f1ecd7b8c4d3de2586f8d41625adc.zip" -> "builds/a1d2442ec7974090e11d208222118de2ed187db6acde96c5907dd1dfcac96f73.zip"
          ~ "timestamp" = "1685052949519179200" -> "1686263200381789000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3264722116176901430" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/f986fdae4a9973c028029db0dcfef2eadd2f1ecd7b8c4d3de2586f8d41625adc.zip" -> "builds/a1d2442ec7974090e11d208222118de2ed187db6acde96c5907dd1dfcac96f73.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-05-25T22:16:11.862+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:1/invocations" -> (known after apply)
      ~ s3_key                         = "builds/82f76e06a4b5d789d2f262461b57d9723a3b2f0e50f4ccc92ad8b2d6b5b3e960.zip" -> "builds/ef13187e6bca66eac3dd34fdc0386365c62ad5a6b4621074f20077adbed87658.zip"
      ~ s3_object_version              = "D8BxSL5NtkukU5JiC9EvzsOwS0NR8blJ" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0393d998cfdef165d159376d79b10b67019b4ee7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:494796dc83a7401391a8bc0266cc1a95c67f0422,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "0393d998cfdef165d159376d79b10b67019b4ee7" -> "494796dc83a7401391a8bc0266cc1a95c67f0422"
                # (11 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "c2f918ec3c9ec203132d79731f951abe-2" -> (known after apply)
      ~ id                     = "builds/82f76e06a4b5d789d2f262461b57d9723a3b2f0e50f4ccc92ad8b2d6b5b3e960.zip" -> (known after apply)
      ~ key                    = "builds/82f76e06a4b5d789d2f262461b57d9723a3b2f0e50f4ccc92ad8b2d6b5b3e960.zip" -> "builds/ef13187e6bca66eac3dd34fdc0386365c62ad5a6b4621074f20077adbed87658.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/82f76e06a4b5d789d2f262461b57d9723a3b2f0e50f4ccc92ad8b2d6b5b3e960.zip" -> "builds/ef13187e6bca66eac3dd34fdc0386365c62ad5a6b4621074f20077adbed87658.zip"
-       tags                   = {} -> null
      ~ version_id             = "D8BxSL5NtkukU5JiC9EvzsOwS0NR8blJ" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/ef13187e6bca66eac3dd34fdc0386365c62ad5a6b4621074f20077adbed87658.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/ef13187e6bca66eac3dd34fdc0386365c62ad5a6b4621074f20077adbed87658.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8164877770712115258" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/82f76e06a4b5d789d2f262461b57d9723a3b2f0e50f4ccc92ad8b2d6b5b3e960.zip" -> "builds/ef13187e6bca66eac3dd34fdc0386365c62ad5a6b4621074f20077adbed87658.zip"
          ~ "timestamp" = "1685052950966347000" -> "1686263199939709000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3528656501784173364" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/82f76e06a4b5d789d2f262461b57d9723a3b2f0e50f4ccc92ad8b2d6b5b3e960.zip" -> "builds/ef13187e6bca66eac3dd34fdc0386365c62ad5a6b4621074f20077adbed87658.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-05-25T22:32:14.505+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/d5a1c36795086bb87ffd7a57ed93b46ba68d543d12cf4930354daa5bd52a3a33.zip" -> "builds/91e39499fd6c6cf0040db41aebdfcc39ddab86bf524c8737cd402b070b29bcae.zip"
      ~ s3_object_version              = "SnbwSGp18lR81QcNrzmOxVjl_jSGm8jL" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:0393d998cfdef165d159376d79b10b67019b4ee7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:494796dc83a7401391a8bc0266cc1a95c67f0422,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "0393d998cfdef165d159376d79b10b67019b4ee7" -> "494796dc83a7401391a8bc0266cc1a95c67f0422"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0e704dfe95784ddec6025890ec3180b8-2" -> (known after apply)
      ~ id                     = "builds/d5a1c36795086bb87ffd7a57ed93b46ba68d543d12cf4930354daa5bd52a3a33.zip" -> (known after apply)
      ~ key                    = "builds/d5a1c36795086bb87ffd7a57ed93b46ba68d543d12cf4930354daa5bd52a3a33.zip" -> "builds/91e39499fd6c6cf0040db41aebdfcc39ddab86bf524c8737cd402b070b29bcae.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/d5a1c36795086bb87ffd7a57ed93b46ba68d543d12cf4930354daa5bd52a3a33.zip" -> "builds/91e39499fd6c6cf0040db41aebdfcc39ddab86bf524c8737cd402b070b29bcae.zip"
-       tags                   = {} -> null
      ~ version_id             = "SnbwSGp18lR81QcNrzmOxVjl_jSGm8jL" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/91e39499fd6c6cf0040db41aebdfcc39ddab86bf524c8737cd402b070b29bcae.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/91e39499fd6c6cf0040db41aebdfcc39ddab86bf524c8737cd402b070b29bcae.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "593909859308333607" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d5a1c36795086bb87ffd7a57ed93b46ba68d543d12cf4930354daa5bd52a3a33.zip" -> "builds/91e39499fd6c6cf0040db41aebdfcc39ddab86bf524c8737cd402b070b29bcae.zip"
          ~ "timestamp" = "1685052951286672200" -> "1686263199993196000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5499071687018874544" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/d5a1c36795086bb87ffd7a57ed93b46ba68d543d12cf4930354daa5bd52a3a33.zip" -> "builds/91e39499fd6c6cf0040db41aebdfcc39ddab86bf524c8737cd402b070b29bcae.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-05-25T22:32:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:4/invocations" -> (known after apply)
      ~ s3_key                         = "builds/4d17c305757107ec3746c41ced215aa778df04472feb073f2991f763d774f551.zip" -> "builds/9556d3a074f8fd4391c0e64389d3023784f1c7b432a3d821d74544fdefcd2684.zip"
      ~ s3_object_version              = "aQDpBXflSp0gfQFQ.n24EU2Ad7CG8qY_" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:0393d998cfdef165d159376d79b10b67019b4ee7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:494796dc83a7401391a8bc0266cc1a95c67f0422,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "0393d998cfdef165d159376d79b10b67019b4ee7" -> "494796dc83a7401391a8bc0266cc1a95c67f0422"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "4" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "37ebdd1451c8f5333ad5282b9f82dc24-2" -> (known after apply)
      ~ id                     = "builds/4d17c305757107ec3746c41ced215aa778df04472feb073f2991f763d774f551.zip" -> (known after apply)
      ~ key                    = "builds/4d17c305757107ec3746c41ced215aa778df04472feb073f2991f763d774f551.zip" -> "builds/9556d3a074f8fd4391c0e64389d3023784f1c7b432a3d821d74544fdefcd2684.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/4d17c305757107ec3746c41ced215aa778df04472feb073f2991f763d774f551.zip" -> "builds/9556d3a074f8fd4391c0e64389d3023784f1c7b432a3d821d74544fdefcd2684.zip"
-       tags                   = {} -> null
      ~ version_id             = "aQDpBXflSp0gfQFQ.n24EU2Ad7CG8qY_" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/9556d3a074f8fd4391c0e64389d3023784f1c7b432a3d821d74544fdefcd2684.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/9556d3a074f8fd4391c0e64389d3023784f1c7b432a3d821d74544fdefcd2684.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "784286083754542302" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4d17c305757107ec3746c41ced215aa778df04472feb073f2991f763d774f551.zip" -> "builds/9556d3a074f8fd4391c0e64389d3023784f1c7b432a3d821d74544fdefcd2684.zip"
          ~ "timestamp" = "1685052877180369000" -> "1686263181894239000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4517136162852575568" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/4d17c305757107ec3746c41ced215aa778df04472feb073f2991f763d774f551.zip" -> "builds/9556d3a074f8fd4391c0e64389d3023784f1c7b432a3d821d74544fdefcd2684.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-05-25T22:16:17.411+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:3/invocations" -> (known after apply)
      ~ s3_key                         = "builds/3a9e3d0b7573e9408f2d3cd8767be778dadbf37bff973f039b912cc84e4e3727.zip" -> "builds/37b9651dc96edf8d82d9444ace283544fc86927f8e86f69132de2178269c027d.zip"
      ~ s3_object_version              = "29bTHl2T.K8tRnj.JUyiJVGUIDxPd3Kg" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:0393d998cfdef165d159376d79b10b67019b4ee7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:494796dc83a7401391a8bc0266cc1a95c67f0422,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "0393d998cfdef165d159376d79b10b67019b4ee7" -> "494796dc83a7401391a8bc0266cc1a95c67f0422"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "911b49d07e86e29f49b9f8a5d7cc2870-2" -> (known after apply)
      ~ id                     = "builds/3a9e3d0b7573e9408f2d3cd8767be778dadbf37bff973f039b912cc84e4e3727.zip" -> (known after apply)
      ~ key                    = "builds/3a9e3d0b7573e9408f2d3cd8767be778dadbf37bff973f039b912cc84e4e3727.zip" -> "builds/37b9651dc96edf8d82d9444ace283544fc86927f8e86f69132de2178269c027d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/3a9e3d0b7573e9408f2d3cd8767be778dadbf37bff973f039b912cc84e4e3727.zip" -> "builds/37b9651dc96edf8d82d9444ace283544fc86927f8e86f69132de2178269c027d.zip"
-       tags                   = {} -> null
      ~ version_id             = "29bTHl2T.K8tRnj.JUyiJVGUIDxPd3Kg" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/37b9651dc96edf8d82d9444ace283544fc86927f8e86f69132de2178269c027d.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/37b9651dc96edf8d82d9444ace283544fc86927f8e86f69132de2178269c027d.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6255019273764219542" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3a9e3d0b7573e9408f2d3cd8767be778dadbf37bff973f039b912cc84e4e3727.zip" -> "builds/37b9651dc96edf8d82d9444ace283544fc86927f8e86f69132de2178269c027d.zip"
          ~ "timestamp" = "1685052951099167200" -> "1686263200148792000"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5838540033482264561" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/3a9e3d0b7573e9408f2d3cd8767be778dadbf37bff973f039b912cc84e4e3727.zip" -> "builds/37b9651dc96edf8d82d9444ace283544fc86927f8e86f69132de2178269c027d.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-05-25T22:15:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:31" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:31/invocations" -> (known after apply)
      ~ s3_key                         = "builds/82cc3fc136b99f8e709e4954f651b27e8a31c14b4dd2a76481f2d5deadabb3e0.zip" -> "builds/351273209bf8268659bf61720df03c7c386ff59269528f1d5e4e1992d0bfe499.zip"
      ~ s3_object_version              = "fXtljDNY6y7M.xTQIZ4iJkHXo4Zv3LNx" -> (known after apply)
        tags                           = {}
      ~ version                        = "31" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:0393d998cfdef165d159376d79b10b67019b4ee7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:494796dc83a7401391a8bc0266cc1a95c67f0422,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "0393d998cfdef165d159376d79b10b67019b4ee7" -> "494796dc83a7401391a8bc0266cc1a95c67f0422"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "31" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f75ce5f0d530278c72be212d7502c1ab-2" -> (known after apply)
      ~ id                     = "builds/82cc3fc136b99f8e709e4954f651b27e8a31c14b4dd2a76481f2d5deadabb3e0.zip" -> (known after apply)
      ~ key                    = "builds/82cc3fc136b99f8e709e4954f651b27e8a31c14b4dd2a76481f2d5deadabb3e0.zip" -> "builds/351273209bf8268659bf61720df03c7c386ff59269528f1d5e4e1992d0bfe499.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/82cc3fc136b99f8e709e4954f651b27e8a31c14b4dd2a76481f2d5deadabb3e0.zip" -> "builds/351273209bf8268659bf61720df03c7c386ff59269528f1d5e4e1992d0bfe499.zip"
-       tags                   = {} -> null
      ~ version_id             = "fXtljDNY6y7M.xTQIZ4iJkHXo4Zv3LNx" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/351273209bf8268659bf61720df03c7c386ff59269528f1d5e4e1992d0bfe499.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/351273209bf8268659bf61720df03c7c386ff59269528f1d5e4e1992d0bfe499.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "260027087451793292" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/82cc3fc136b99f8e709e4954f651b27e8a31c14b4dd2a76481f2d5deadabb3e0.zip" -> "builds/351273209bf8268659bf61720df03c7c386ff59269528f1d5e4e1992d0bfe499.zip"
          ~ "timestamp" = "1685052877338748000" -> "1686263181710309000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4727776812771159237" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/82cc3fc136b99f8e709e4954f651b27e8a31c14b4dd2a76481f2d5deadabb3e0.zip" -> "builds/351273209bf8268659bf61720df03c7c386ff59269528f1d5e4e1992d0bfe499.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 40 to add, 13 to change, 32 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5216277007)*